import { Box, Typography, IconButton, Dialog, DialogTitle, DialogContent, Button, Container } from '@mui/material';
import { useState } from 'react';

//Τα σημεία ενδιαφέροντος
const landmarks = [
  { id: 1, name: "Εθνικός Κήπος", info: "Ο Εθνικός Κήπος αποτελεί χαρακτηρισμένο Ιστορικό Τόπο στο κέντρο της Αθήνας ανάμεσα στις συνοικίες του Κολωνακίου και του Παγκρατίου. Η πρώτη του ονομασία μέχρι το 1927 ήταν «Βασιλικός Κήπος». Το πάρκο βρίσκεται δίπλα από τη Βουλή των Ελλήνων και εκτείνεται προς τα νότια όπου βρίσκεται το Ζάππειο Μέγαρο απέναντι από το Παναθηναϊκό Στάδιο, όπου τελέστηκαν οι πρώτοι Μοντέρνοι Ολυμπιακοί αγώνες το 1896.", top: "17%", left: "83%" },
  { id: 2, name: "Εθνικό Μουσείο Σύγχρονης Τέχνης", info: "Το Εθνικό Μουσείο Σύγχρονης Τέχνης (ΕΜΣΤ) ξεκίνησε τη λειτουργία του το 2000. Από το 2016, μόνιμη στέγη του μουσείου είναι το πρώην εργοστάσιο ζυθοποιίας Φιξ στη λεωφόρο Συγγρού, η ανακατασκευή του οποίου ολοκληρώθηκε τον Φεβρουάριο του 2014.", top: "28%", left: "78%" },
  { id: 3, name: "Στάδιο Γεώργιος Καραισκάκης", info: "Το Στάδιο «Γεώργιος Καραϊσκάκης» είναι σύγχρονο ελληνικό στάδιο ποδοσφαίρου και βρίσκεται στο Νέο Φάληρο στον Πειραιά. Ονομάστηκε στη μνήμη του αρχιστράτηγου της Επανάστασης του 1821, Γεωργίου Καραϊσκάκη (1782-1827). Το Στάδιο έχει χωρητικότητα 33.334 θέσεων και αποτελεί το δεύτερο μεγαλύτερο γήπεδο της χώρας μετά το Ολυμπιακό Στάδιο Αθηνών (ΟΑΚΑ). Κατασκευάστηκε το 1895 ως ποδηλατοδρόμιο για τους Ολυμπιακούς Αγώνες της Αθήνας, τους πρώτους της σύγχρονης εποχής, που διεξήχθησαν την επόμενη χρονιά (1896).", top: "60%", left: "33%" }
];

export const MapPage = ({ onBack }: { onBack: () => void }) => {
  const [selectedPoint, setSelectedPoint] = useState<any>(null);

  return (
    <Container maxWidth="lg"  sx={{width:"45%", mt: 2 }}>
      <Typography variant="h4" textAlign="center" fontWeight="bold" gutterBottom>Η Διαδρομή</Typography>
      
      {/*Container του χάρτη */}
      <Box sx={{ position: 'relative', width: '100%', borderRadius: 4, overflow: 'hidden' }}>
        <img 
          src="/public/img/040b.png" //η εικόνα
          alt="Satellite Map"
          
          style={{ width: '100%', display: 'block' ,backgroundColor:"background.paper"}}
        />

        {landmarks.map((point) => (
          <IconButton
            key={point.id}
            onClick={() => setSelectedPoint(point)}
            sx={{
              position: 'absolute',
              top: point.top,
              left: point.left,
              color: 'red',
              '&:hover': { 
              bgcolor: "background.paper" },
              transform: 'translate(-50%, -50%)' 
            }}
          >
            📍
          </IconButton>
        ))}
      </Box>

      {/*Παράθυρο Πληροφοριών*/}
      <Dialog open={Boolean(selectedPoint)} onClose={() => setSelectedPoint(null)} fullWidth maxWidth="xs">
        {selectedPoint && (
          <>
            <DialogTitle sx={{ fontWeight: 'bold' }}>{selectedPoint.name}</DialogTitle>
            <DialogContent dividers>
              <Typography variant="body1">{selectedPoint.info}</Typography>
            </DialogContent>
            <Box sx={{ p: 2, textAlign: 'right' }}>
              <Button onClick={() => setSelectedPoint(null)} variant="contained">Κλείσιμο</Button>
            </Box>
          </>
        )}
      </Dialog>
    </Container>
  );
};